# Imported file

# Tools
brew "act"
brew "ansible"
brew "ansible-lint"
brew "foundry"
brew "go@1.25"
brew "golangci-lint"
brew "helm"
brew "htop"
brew "kubernetes-cli"
brew "kubectx"
brew "kubecolor"
brew "nvm"
brew "openssh"
brew "pyenv"
brew "rclone"
brew "ripgrep"
brew "saml2aws"
brew "telnet"
brew "tmux"
brew "watch"
brew "wget"
brew "gh"
cask "font-hack-nerd-font"
cask "google-cloud-sdk"
cask "kitty"
brew "yq"

# Personalization
brew "zsh-syntax-highlighting"
brew "fzf"
cask "rectangle"

# VSCode
vscode "arcticicestudio.nord-visual-studio-code"
vscode "golang.go"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
